/*=======================================================
<<<<<<<<<<<<<<<<<<< 爱普雷德技术团队 >>>>>>>>>>>>>>>>>>>>
<<<<<<<<<<<<<<<<<<< 我们一起追求卓越 >>>>>>>>>>>>>>>>>>>>
---------------------------------------------------------
旗舰网店: http://aplid.taobao.com/
官方邮箱: njaplid@163.com
 技术QQ1: 535676091
 技术QQ2: 1915624375
 技术QQ3: 154211813
---------------------------------------------------------
               All right reserved.2013.01
---------------------------------------------------------
 文件名: IO_def.h
 描述: 对所有IO进行未定义
 作者:
=========================================================
-----------------------------------------------------------------------------------------------------------*/
#ifndef __IO_DEF_H__
#define __IO_DEF_H__

#include <reg52.h>

sbit P00  =  P0^0;
sbit P01  =  P0^1;
sbit P02  =  P0^2;
sbit P03  =  P0^3;
sbit P04  =  P0^4;
sbit P05  =  P0^5;
sbit P06  =  P0^6;
sbit P07  =  P0^7;

sbit P10  =  P1^0;
sbit P11  =  P1^1;
sbit P12  =  P1^2;
sbit P13  =  P1^3;
sbit P14  =  P1^4;
sbit P15  =  P1^5;
sbit P16  =  P1^6;
sbit P17  =  P1^7;

sbit P20  =  P2^0;
sbit P21  =  P2^1;
sbit P22  =  P2^2;
sbit P23  =  P2^3;
sbit P24  =  P2^4;
sbit P25  =  P2^5;
sbit P26  =  P2^6;
sbit P27  =  P2^7;

sbit P30  =  P3^0;
sbit P31  =  P3^1;
sbit P32  =  P3^2;
sbit P33  =  P3^3;
sbit P34  =  P3^4;
sbit P35  =  P3^5;
sbit P36  =  P3^6;
sbit P37  =  P3^7;

#endif